{
  "NotFound": {
    "title": "Oops... nothing here! 😬",
    "description": "But don't worry, how about checking out my <blog>blog</blog> or taking a look at my <projects>projects</projects>?",
    "articles": "Pinned posts:"
  },
  "IndexPage": {
    "about": "I’ve been working as a Web Developer since 2021 and I’m currently a Front-End Developer at Juntos Somos Mais."
  },
  "CarrerPage": {
    "Experiences": {
      "Juntos Somos Mais": {
        "title": "Juntos Somos Mais",
        "time": "2021 - Present",
        "totalContributions": "8",
        "contributions": {
          "1": "Developed continuous features for the e-commerce platform and loyalty program.",
          "2": "Worked on the open-source design system <atomium>Atomium</atomium>, prioritizing tasks, developing components, fixing bugs, and reviewing PRs.",
          "3": "Redesigned the front-end engineering team's documentation process.",
          "4": "Contributed to reducing technical debt through refactoring, optimizations, security fixes, and performance improvements, such as handling chunk errors.",
          "5": "Developed solutions for security rules, including writing documentation about the causes, analysis, and resolutions.",
          "6": "Contributed to improving the squad's workflow both individually and collectively.",
          "7": "Participated in meetings and events focused on front-end and other broad topics, connecting with professionals who have enhanced my technical and interpersonal development.",
          "8": "Collaborated with product, UI/UX, and engineering teams to align technical solutions with business objectives and the design system."
        },
        "link": "https://g.co/kgs/eVwdD6s"
      },
      "Nimbus Black": {
        "title": "Nimbus Black",
        "time": "2024 - Present",
        "totalContributions": "4",
        "contributions": {
          "1": "Contributed to the cloud platform.",
          "2": "Created layout and design system standards in Figma, such as colors, typography, spacing, etc.",
          "3": "Integrated with payment APIs, cloud services, user CRUD, and more.",
          "4": "Documented architecture decisions and the technologies used on the front-end."
        },
        "link": ""
      },
      "React4Noobs": {
        "title": "React4Noobs",
        "time": "2023 - Present",
        "totalContributions": "3",
        "contributions": {
          "1": "Created articles on React Design Patterns concepts such as Compound Components, Error Boundaries, etc.",
          "2": "Improved the project through architecture management and organization.",
          "3": "Reviewed and merged pull requests, provided suggestions, and answered questions."
        },
        "link": "https://github.com/he4rt/react4noobs"
      },
      "He4rt Team": {
        "title": "He4rt Team",
        "time": "Jun 2022 - Jan 2023",
        "totalContributions": "5",
        "contributions": {
          "1": "Front-end development contributions to a website project that was paused.",
          "2": "Participation and contributions to project improvements.",
          "3": "Attended meetings to improve communication and help steer project development with the team.",
          "4": "Opportunity to work with a dedicated and welcoming team, where I had space to learn new technologies from scratch.",
          "5": "Main technologies used: JavaScript ES6+, Next.js, React.js, Chakra UI, Git, and GitHub."
        },
        "link": ""
      }
    }
  }
}