{
  "NotFound": {
    "title": "Ops... nada por aqui! 😬",
    "description": "Mas não desanime, que tal dar uma olhada no meu <blog>blog</blog> ou ver meus <projects>projetos</projects>?",
    "articles": "Posts fixados:"
  },
  "IndexPage": {
    "about": "Trabalho como desenvolvedor web desde 2021 e atualmente sou desenvolvedor front-end na Juntos Somos Mais."
  },
  "CarrerPage": {
    "Experiences": {
      "Juntos Somos Mais": {
        "title": "Juntos Somos Mais",
        "time": "2021 - Present",
        "totalContributions": "8",
        "contributions": {
          "1": "Desenvolvi funcionalidades contínuas para a plataforma de e-commerce e programa de fidelidade.",
          "2": "Atuei no Design System open source <atomium>Atomium</atomium>, priorizando demandas, desenvolvendo componentes, corrigindo bugs e revisando PRs.",
          "3": "Reformulei o processo de documentação do time de engenharia de front.",
          "4": "Atuei na redução de débito técnico por meio de refatorações, otimizações, correções de segurança e melhorias de performance, como tratativa de erros de chunks.",
          "5": "Desenvolvi soluções para regras de segurança, além de escrever documentações sobre a causa, análise e solução.",
          "6": "Contribuí com o time para melhorar o fluxo da squad tanto individualmente quanto em conjunto.",
          "7": "Participei em reuniões e eventos voltados para front-end e outros temas abrangentes, tendo contato com profissionais que impulsionam meu desenvolvimento técnico e interpessoal.",
          "8": "Colaborei com produto, UI/UX e engenharia para alinhar soluções técnicas com os objetivos do negócio e design system."
        },
        "link": "https://g.co/kgs/eVwdD6s"
      },
      "Nimbus Black": {
        "title": "Nimbus Black",
        "time": "2024 - Present",
        "totalContributions": "6",
        "contributions": {
          "1": "Meu primeiro projeto internacional como freelancer.",
          "2": "Fiz contribuições para a plataforma de cloud.",
          "3": "Criei o layout no figma e padrões do design system, tais como cores, tipografia, espaçamento, etc.",
          "4": "Integração com APIs de pagamento, cloud, crud de usuários, etc.",
          "5": "Documentei a decisão de arquitetura e as tecnologias utilizadas no front-end",
          "6": "Discuti regras de negócio com o time e sugeri melhorias no fluxo de trabalho."
        },
        "link": ""
      },
      "React4Noobs": {
        "title": "React4Noobs",
        "time": "2023 - Present",
        "totalContributions": "4",
        "contributions": {
          "1": "Criação de artigos sobre conceitos de Design Patterns em React, como Compound Components, Error Boundaries, etc...",
          "2": "Melhorias do projeto, como gerenciamento de arquitetura e organização.",
          "3": "Revisões/Merge de Pull requestes, fazendo sugestões e tirando dúvidas.",
          "4": "Link do repositório: https://github.com/he4rt/react4noobs"
        },
        "link": "https://github.com/he4rt/react4noobs"
      },
      "He4rt Team": {
        "title": "He4rt Team",
        "time": "Jun 2022 - Jan 2023",
        "totalContributions": "5",
        "contributions": {
          "1": "Contribuição no desenvolvimento front-end para o site que estava em andamento, mas acabou que o projeto teve que ser pausado.",
          "2": "Participação e contribuição nas melhorias do projeto.",
          "3": "Participação de reuniões com o objetivo de melhorar a comunicação e poder tomar direção para o desenvolvimento do projeto junto com o time.",
          "4": "Oportunidade de trabalhar com um time dedicado e acolhedor, onde tive espaço até mesmo para aprender tecnologias do zero.",
          "5": "Tecnologias mais utilizadas: Javascript ES6+, Next.js, ReactJs, Chakra UI, git e github."
        },
        "link": ""
      }
    }
  },
  "BlogPage": {
    "contribution": "Gostou do conteúdo? Aceito uma contribuição! :)",
    "contributionDescription1": "PIX: gabrielmonteiroduete@gmail.com",
    "contributionDescription2": "Aceito um café: <a>ko-fi.com/gabrielduete</a>",
    "addSomething": "Tem algo para acrescentar?",
    "addSomethingDescription": "Esse blog é open source, então fique a vontade para fazer abrir um <a>PR no repositório.</a>",
    "findMe": "Me encontre também em:"
  }
}